Demo/app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `title` = 'Test !!!!', `text` = 'Tester!!', `updated_at` = '2015-06-20 15:05:06' WHERE `articles`.`id` = 2

  def create
  @article = Article.new(article_params)
    if @article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('Ramesh', 'pppppppppp', '2015-06-20 13:20:44', '2015-06-20 13:20:44')